engineSimOne - Copy/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;
boundaryField
{
    freestream
    {
        type            waveTransmissive;
        gamma           1.14;
        fieldInf        300;
        lInf            10;
        value           uniform 300;
    }
    inlet
    {
        type         totalTemperature;
	gamma        1.14;
        T0           uniform 3538.04;
	value	     uniform 3538.04;
    }
    walls
    {
        type            zeroGradient;
    }
    bottomEmptyFaces
    {
        type            empty;
    }
    topEmptyFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
