engineSimOne - Copy/0/alphat
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2412                                 |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    freestream
    {
        type            calculated;
        value           uniform 0;
    }

    walls
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

    bottomEmptyFaces
    {
	type		empty;
    }

    topEmptyFaces
    {
        type            empty;
    }

}


// ************************************************************************* //